una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Freescale/MK51N512CMD100.h
/* NV - Peripheral instance base addresses */
/*! Peripheral FTFL_FlashConfig base pointer */
#define FTFL_FlashConfig_BASE_PTR                ((NV_MemMapPtr)0x400u)

/* ----------------------------------------------------------------------------
   -- NV - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup NV_Register_Accessor_Macros NV - Register accessor macros */
/*! \{ */


/* NV - Register instance definitions */
/* FTFL_FlashConfig */
#define NV_BACKKEY0                              NV_BACKKEY0_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_BACKKEY1                              NV_BACKKEY1_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_BACKKEY2                              NV_BACKKEY2_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_BACKKEY3                              NV_BACKKEY3_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_BACKKEY4                              NV_BACKKEY4_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_BACKKEY5                              NV_BACKKEY5_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_BACKKEY6                              NV_BACKKEY6_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_BACKKEY7                              NV_BACKKEY7_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_FPROT3                                NV_FPROT3_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_FPROT2                                NV_FPROT2_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_FPROT1                                NV_FPROT1_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_FPROT0                                NV_FPROT0_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_FOPT                                  NV_FOPT_REG(FTFL_FlashConfig_BASE_PTR)
#define NV_FSEC                                  NV_FSEC_REG(FTFL_FlashConfig_BASE_PTR)

/*! \} */ /* end of group NV_Register_Accessor_Macros */


/*! \} */ /* end of group NV_Peripheral */


/* ----------------------------------------------------------------------------
   -- FTM
   ---------------------------------------------------------------------------- */

/*! \addtogroup FTM_Peripheral FTM */
/*! \{ */

/*! FTM - Peripheral register structure */
typedef struct FTM_MemMap {
  uint32_t SC;                                     /*!< Status and Control, offset: 0x0 */
  uint32_t CNT;                                    /*!< Counter, offset: 0x4 */
  uint32_t MOD;                                    /*!< Modulo, offset: 0x8 */
  struct {                                         /* offset: 0xC, array step: 0x8 */
    uint32_t CnSC;                                   /*!< Channel (n) Status and Control, array offset: 0xC, array step: 0x8 */
    uint32_t CnV;                                    /*!< Channel (n) Value, array offset: 0x10, array step: 0x8 */
  } CONTROLS[8];
  uint32_t CNTIN;                                  /*!< Counter Initial Value, offset: 0x4C */
  uint32_t STATUS;                                 /*!< Capture and Compare Status, offset: 0x50 */
  uint32_t MODE;                                   /*!< Features Mode Selection, offset: 0x54 */
  uint32_t SYNC;                                   /*!< Synchronization, offset: 0x58 */
  uint32_t OUTINIT;                                /*!< Initial State for Channels Output, offset: 0x5C */
  uint32_t OUTMASK;                                /*!< Output Mask, offset: 0x60 */
  uint32_t COMBINE;                                /*!< Function for Linked Channels, offset: 0x64 */
  uint32_t DEADTIME;                               /*!< Deadtime Insertion Control, offset: 0x68 */
  uint32_t EXTTRIG;                                /*!< FTM External Trigger, offset: 0x6C */
  uint32_t POL;                                    /*!< Channels Polarity, offset: 0x70 */
  uint32_t FMS;                                    /*!< Fault Mode Status, offset: 0x74 */
  uint32_t FILTER;                                 /*!< Input Capture Filter Control, offset: 0x78 */
  uint32_t FLTCTRL;                                /*!< Fault Control, offset: 0x7C */
  uint32_t QDCTRL;                                 /*!< Quadrature Decoder Control and Status, offset: 0x80 */
  uint32_t CONF;                                   /*!< Configuration, offset: 0x84 */
  uint32_t FLTPOL;                                 /*!< FTM Fault Input Polarity, offset: 0x88 */
  uint32_t SYNCONF;                                /*!< Synchronization Configuration, offset: 0x8C */
  uint32_t INVCTRL;                                /*!< FTM Inverting Control, offset: 0x90 */
  uint32_t SWOCTRL;                                /*!< FTM Software Output Control, offset: 0x94 */
  uint32_t PWMLOAD;                                /*!< FTM PWM Load, offset: 0x98 */
} volatile *FTM_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- FTM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup FTM_Register_Accessor_Macros FTM - Register accessor macros */
/*! \{ */


/* FTM - Register accessors */
#define FTM_SC_REG(base)                         ((base)->SC)
#define FTM_CNT_REG(base)                        ((base)->CNT)
#define FTM_MOD_REG(base)                        ((base)->MOD)
#define FTM_CnSC_REG(base,index)                 ((base)->CONTROLS[index].CnSC)
#define FTM_CnV_REG(base,index)                  ((base)->CONTROLS[index].CnV)
#define FTM_CNTIN_REG(base)                      ((base)->CNTIN)
#define FTM_STATUS_REG(base)                     ((base)->STATUS)
#define FTM_MODE_REG(base)                       ((base)->MODE)
#define FTM_SYNC_REG(base)                       ((base)->SYNC)
#define FTM_OUTINIT_REG(base)                    ((base)->OUTINIT)
#define FTM_OUTMASK_REG(base)                    ((base)->OUTMASK)
#define FTM_COMBINE_REG(base)                    ((base)->COMBINE)
#define FTM_DEADTIME_REG(base)                   ((base)->DEADTIME)
#define FTM_EXTTRIG_REG(base)                    ((base)->EXTTRIG)
#define FTM_POL_REG(base)                        ((base)->POL)
#define FTM_FMS_REG(base)                        ((base)->FMS)
#define FTM_FILTER_REG(base)                     ((base)->FILTER)
#define FTM_FLTCTRL_REG(base)                    ((base)->FLTCTRL)
#define FTM_QDCTRL_REG(base)                     ((base)->QDCTRL)
#define FTM_CONF_REG(base)                       ((base)->CONF)
#define FTM_FLTPOL_REG(base)                     ((base)->FLTPOL)
#define FTM_SYNCONF_REG(base)                    ((base)->SYNCONF)
#define FTM_INVCTRL_REG(base)                    ((base)->INVCTRL)
#define FTM_SWOCTRL_REG(base)                    ((base)->SWOCTRL)
#define FTM_PWMLOAD_REG(base)                    ((base)->PWMLOAD)

/*! \} */ /* end of group FTM_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- FTM Register Masks
   ---------------------------------------------------------------------------- */

